SOLU/TestingStrategies-Particle/tests/Cases/AbramzonSirignano/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             test.exe;

startFrom               startTime;

startTime               0;

stopAt                  endTime;

endTime                 2;

deltaT                  1;

writeControl            timeStep;

writeInterval           1000;

writeFormat             ascii;

writePrecision          6;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   0.25;

maxDeltaT               5e-7;

// ************************************************************************* //3
